src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписании</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРегистрации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассмотрен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/extensions/ДокументооборотКОРП_ДополнительныеОбработчикиДляПроцессов/CommonModules/ИТГ_Делопроизводство/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ВНУТРЕННИМИ, ВХОДЯЩИМИ И ИСХОДЯЩИМИ ДОКУМЕНТАМИ
// 

#Область ПрограммныйИнтерфейс

// Проверяет, находится ли документ на исполнении (на исполнении либо исполнен,
//  на рассмотрении либо рассмотрен, на ознакомлении)
//
// Параметры:
//  Документ - СправочникСсылка	 - ссылка на внутренний либо входящий документ
// 
// Возвращаемое значение:
//  Булево - Истина, если документ на исполнении, Ложь - если нет
//
Функция ПроверитьСостояниеДокументаНаИсполнении(Знач Документ) Экспорт
		
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МассивСостояний = Делопроизводство.ПолучитьВсеСостоянияДокумента(Документ).ВыгрузитьКолонку("Состояние");
		
	СоответствиеСостоянийНаИсполнении = ПолучитьСоответствиеСостоянийНаИсполнении();
	
	Для Каждого Состояние Из МассивСостояний Цикл
		Если СоответствиеСостоянийНаИсполнении.Получить(Состояние) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает соответствие состояний документов на стадии исполнения (на исполнении либо исполнен,
//  на рассмотрении либо рассмотрен, на ознакомлении)
// 
// Возвращаемое значение:
//  Соответствие
//
Функция ПолучитьСоответствиеСостоянийНаИсполнении() Экспорт  
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НаСогласовании, 	  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НеСогласован, 	  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Согласован, 		  Ложь);
	
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НаУтверждении, 	  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НеУтвержден, 	  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Утвержден, 		  Ложь);
	
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НаПодписании, 	  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Отклонен,		  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Подписан, 		  Ложь);
	
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Проект, 			  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НаРегистрации, 	  Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Зарегистрирован,   Ложь);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НеЗарегистрирован, Ложь);
	
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НаРассмотрении, 	  Истина);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Рассмотрен, 	   	  Истина);
	
	Соответствие.Вставить(Перечисления.СостоянияДокументов.НаИсполнении, 	  Истина);
	Соответствие.Вставить(Перечисления.СостоянияДокументов.Исполнен, 		  Истина);
	
	Возврат Соответствие;
	
КонецФункции	

#КонецОбласти
